Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pic32cz4010ca80144.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M7 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnFCW_Handler;                          /*   0 Flash Write Control (FCW) (FCW) */
  void* pfnFCR_ECCERR_Handler;                   /*   1 Flash Read Controller (FCR) (FCR) */
  void* pfnFCR_CRC_FAULT_Handler;                /*   2 Flash Read Controller (FCR) (FCR) */
  void* pfnPM_Handler;                           /*   3 Power Manager (PM) */
  void* pfnSUPC_Handler;                         /*   4 Supply Controller (SUPC) */
  void* pfnOSCCTRL_FAIL_Handler;                 /*   5 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_XOSCRDY_Handler;              /*   6 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_DFLLRDY_Handler;              /*   7 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_OTHER_Handler;                /*   8 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_LOCK_Handler;                 /*   9 Oscillators Control (OSCCTRL) */
  void* pfnOSC32KCTRL_FAIL_Handler;              /*  10 32kHz Oscillators Control (OSC32KCTRL) */
  void* pfnOSC32KCTRL_RDY_Handler;               /*  11 32kHz Oscillators Control (OSC32KCTRL) */
  void* pfnMCLK_Handler;                         /*  12 Main Clock (MCLK) */
  void* pfnFREQM_Handler;                        /*  13 Frequency Meter (FREQM) */
  void* pfnWDT_Handler;                          /*  14 Watchdog Timer (WDT) */
  void* pfnRTC_TAMPER_Handler;                   /*  15 Real-Time Counter (RTC) */
  void* pfnRTC_OVF_Handler;                      /*  16 Real-Time Counter (RTC) */
  void* pfnRTC_PERIOD_Handler;                   /*  17 Real-Time Counter (RTC) */
  void* pfnRTC_COMPARE_Handler;                  /*  18 Real-Time Counter (RTC) */
  void* pfnEIC_EXTINT_0_Handler;                 /*  19 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_1_Handler;                 /*  20 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_2_Handler;                 /*  21 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_3_Handler;                 /*  22 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_4_Handler;                 /*  23 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_5_Handler;                 /*  24 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_6_Handler;                 /*  25 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_7_Handler;                 /*  26 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_8_Handler;                 /*  27 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_9_Handler;                 /*  28 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_10_Handler;                /*  29 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_11_Handler;                /*  30 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_12_Handler;                /*  31 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_13_Handler;                /*  32 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_14_Handler;                /*  33 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_15_Handler;                /*  34 External Interrupt Controller (EIC) */
  void* pfnPAC_Handler;                          /*  35 Peripheral Access Controller (PAC) */
  void* pfnDRMTCM_Handler;                       /*  36 DRM TCM ECC (DRMTCM) */
  void* pfnMCRAMC_Handler;                       /*  37 Multi-Channel RAM Controller (MCRAMC) */
  void* pfnTRAM_Handler;                         /*  38 TrustRAM (TRAM) */
  void* pfnDMA_PRI3_Handler;                     /*  39 Direct Memory Access Controller (DMA) */
  void* pfnDMA_PRI2_Handler;                     /*  40 Direct Memory Access Controller (DMA) */
  void* pfnDMA_PRI1_Handler;                     /*  41 Direct Memory Access Controller (DMA) */
  void* pfnDMA_PRI0_Handler;                     /*  42 Direct Memory Access Controller (DMA) */
  void* pfnEVSYS_0_Handler;                      /*  43 Event System Interface (EVSYS) */
  void* pfnEVSYS_1_Handler;                      /*  44 Event System Interface (EVSYS) */
  void* pfnEVSYS_2_Handler;                      /*  45 Event System Interface (EVSYS) */
  void* pfnEVSYS_3_Handler;                      /*  46 Event System Interface (EVSYS) */
  void* pfnEVSYS_4_Handler;                      /*  47 Event System Interface (EVSYS) */
  void* pfnEVSYS_5_Handler;                      /*  48 Event System Interface (EVSYS) */
  void* pfnEVSYS_6_Handler;                      /*  49 Event System Interface (EVSYS) */
  void* pfnEVSYS_7_Handler;                      /*  50 Event System Interface (EVSYS) */
  void* pfnEVSYS_8_Handler;                      /*  51 Event System Interface (EVSYS) */
  void* pfnEVSYS_9_Handler;                      /*  52 Event System Interface (EVSYS) */
  void* pfnEVSYS_10_Handler;                     /*  53 Event System Interface (EVSYS) */
  void* pfnEVSYS_11_Handler;                     /*  54 Event System Interface (EVSYS) */
  void* pfnSERCOM0_6_Handler;                    /*  55 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_5_Handler;                    /*  56 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_0_Handler;                    /*  57 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_1_Handler;                    /*  58 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_2_Handler;                    /*  59 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_3_Handler;                    /*  60 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_4_Handler;                    /*  61 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_6_Handler;                    /*  62 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_5_Handler;                    /*  63 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_0_Handler;                    /*  64 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_1_Handler;                    /*  65 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_2_Handler;                    /*  66 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_3_Handler;                    /*  67 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_4_Handler;                    /*  68 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_6_Handler;                    /*  69 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_5_Handler;                    /*  70 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_0_Handler;                    /*  71 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_1_Handler;                    /*  72 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_2_Handler;                    /*  73 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_3_Handler;                    /*  74 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_4_Handler;                    /*  75 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_6_Handler;                    /*  76 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_5_Handler;                    /*  77 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_0_Handler;                    /*  78 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_1_Handler;                    /*  79 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_2_Handler;                    /*  80 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_3_Handler;                    /*  81 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_4_Handler;                    /*  82 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM4_6_Handler;                    /*  83 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_5_Handler;                    /*  84 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_0_Handler;                    /*  85 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_1_Handler;                    /*  86 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_2_Handler;                    /*  87 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_3_Handler;                    /*  88 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_4_Handler;                    /*  89 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM5_6_Handler;                    /*  90 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_5_Handler;                    /*  91 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_0_Handler;                    /*  92 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_1_Handler;                    /*  93 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_2_Handler;                    /*  94 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_3_Handler;                    /*  95 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_4_Handler;                    /*  96 Serial Communication Interface (SERCOM5) */
  void* pvReserved97;
  void* pvReserved98;
  void* pvReserved99;
  void* pvReserved100;
  void* pvReserved101;
  void* pvReserved102;
  void* pvReserved103;
  void* pvReserved104;
  void* pvReserved105;
  void* pvReserved106;
  void* pvReserved107;
  void* pvReserved108;
  void* pvReserved109;
  void* pvReserved110;
  void* pvReserved111;
  void* pvReserved112;
  void* pvReserved113;
  void* pvReserved114;
  void* pvReserved115;
  void* pvReserved116;
  void* pvReserved117;
  void* pvReserved118;
  void* pvReserved119;
  void* pvReserved120;
  void* pvReserved121;
  void* pvReserved122;
  void* pvReserved123;
  void* pvReserved124;
  void* pfnTCC0_OTHER_Handler;                   /* 125 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_CNT_TRIG_Handler;                /* 126 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC0_Handler;                     /* 127 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC1_Handler;                     /* 128 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC2_Handler;                     /* 129 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC3_Handler;                     /* 130 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC4_Handler;                     /* 131 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC5_Handler;                     /* 132 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC6_Handler;                     /* 133 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC7_Handler;                     /* 134 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC1_OTHER_Handler;                   /* 135 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_CNT_TRIG_Handler;                /* 136 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC0_Handler;                     /* 137 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC1_Handler;                     /* 138 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC2_Handler;                     /* 139 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC3_Handler;                     /* 140 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC4_Handler;                     /* 141 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC5_Handler;                     /* 142 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC6_Handler;                     /* 143 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC7_Handler;                     /* 144 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC2_OTHER_Handler;                   /* 145 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_CNT_TRIG_Handler;                /* 146 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC0_Handler;                     /* 147 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC1_Handler;                     /* 148 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC2_Handler;                     /* 149 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC3_Handler;                     /* 150 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC4_Handler;                     /* 151 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC5_Handler;                     /* 152 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC3_OTHER_Handler;                   /* 153 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_CNT_TRIG_Handler;                /* 154 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC0_Handler;                     /* 155 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC1_Handler;                     /* 156 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC4_OTHER_Handler;                   /* 157 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_CNT_TRIG_Handler;                /* 158 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_MC0_Handler;                     /* 159 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_MC1_Handler;                     /* 160 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC5_OTHER_Handler;                   /* 161 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_CNT_TRIG_Handler;                /* 162 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_MC0_Handler;                     /* 163 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_MC1_Handler;                     /* 164 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC6_OTHER_Handler;                   /* 165 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_CNT_TRIG_Handler;                /* 166 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_MC0_Handler;                     /* 167 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_MC1_Handler;                     /* 168 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC7_OTHER_Handler;                   /* 169 Timer Counter for Control Applications (TCC7) */
  void* pfnTCC7_CNT_TRIG_Handler;                /* 170 Timer Counter for Control Applications (TCC7) */
  void* pfnTCC7_MC0_Handler;                     /* 171 Timer Counter for Control Applications (TCC7) */
  void* pfnTCC7_MC1_Handler;                     /* 172 Timer Counter for Control Applications (TCC7) */
  void* pfnTCC8_OTHER_Handler;                   /* 173 Timer Counter for Control Applications (TCC8) */
  void* pfnTCC8_CNT_TRIG_Handler;                /* 174 Timer Counter for Control Applications (TCC8) */
  void* pfnTCC8_MC0_Handler;                     /* 175 Timer Counter for Control Applications (TCC8) */
  void* pfnTCC8_MC1_Handler;                     /* 176 Timer Counter for Control Applications (TCC8) */
  void* pfnTCC9_OTHER_Handler;                   /* 177 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_CNT_TRIG_Handler;                /* 178 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_MC0_Handler;                     /* 179 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_MC1_Handler;                     /* 180 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_MC2_Handler;                     /* 181 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_MC3_Handler;                     /* 182 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_MC4_Handler;                     /* 183 Timer Counter for Control Applications (TCC9) */
  void* pfnTCC9_MC5_Handler;                     /* 184 Timer Counter for Control Applications (TCC9) */
  void* pfnADC_GLOBAL_Handler;                   /* 185 ADC Controller (ADC) */
  void* pfnADC_CORE1_Handler;                    /* 186 ADC Controller (ADC) */
  void* pfnADC_CORE2_Handler;                    /* 187 ADC Controller (ADC) */
  void* pfnADC_CORE3_Handler;                    /* 188 ADC Controller (ADC) */
  void* pfnADC_CORE4_Handler;                    /* 189 ADC Controller (ADC) */
  void* pfnAC_Handler;                           /* 190 Analog Comparator Controller (AC) */
  void* pfnPTC_Handler;                          /* 191 Peripheral Touch Controller (PTC) */
  void* pfnSPI_IXS0_Handler;                     /* 192 Audio SPI with 8 channels compatibilty (SPI_IXS0) */
  void* pvReserved193;
  void* pfnCAN0_Handler;                         /* 194 Control Area Network (CAN0) */
  void* pfnCAN1_Handler;                         /* 195 Control Area Network (CAN1) */
  void* pfnCAN2_Handler;                         /* 196 Control Area Network (CAN2) */
  void* pfnCAN3_Handler;                         /* 197 Control Area Network (CAN3) */
  void* pvReserved198;
  void* pvReserved199;
  void* pvReserved200;
  void* pvReserved201;
  void* pfnETH_PRI_Q_0_Handler;                  /* 202 Ethernet Controller (ETH) */
  void* pfnETH_PRI_Q_1_Handler;                  /* 203 Ethernet Controller (ETH) */
  void* pfnETH_PRI_Q_2_Handler;                  /* 204 Ethernet Controller (ETH) */
  void* pfnETH_PRI_Q_3_Handler;                  /* 205 Ethernet Controller (ETH) */
  void* pfnETH_PRI_Q_4_Handler;                  /* 206 Ethernet Controller (ETH) */
  void* pfnETH_PRI_Q_5_Handler;                  /* 207 Ethernet Controller (ETH) */
  void* pfnSQI0_Handler;                         /* 208 Polaris Serial Quad Interface SIB (SQI0) */
  void* pvReserved209;
  void* pfnTRNG_Handler;                         /* 210 True Random Generator (TRNG) */
  void* pfnSDMMC0_Handler;                       /* 211 SD/MMC Host Controller (SDMMC0) */
  void* pvReserved212;
  void* pfnUSBHS0_Handler;                       /* 213 USB High Speed (USBHS0) */
  void* pvReserved214;
  void* pvReserved215;
  void* pvReserved216;
  void* pvReserved217;
  void* pfnMLB_GENERAL_Handler;                  /* 218 Media Local Bus (MLB) */
  void* pfnMLB_BUSREQ_Handler;                   /* 219 Media Local Bus (MLB) */
  void* pvReserved220;
  void* pvReserved221;
} DeviceVectors;

